#include "sfml.h"

int main() {
	// 0 - пустая клетка
	// 1 - препятствие
	// 2 - начало
	// 3 - конец
	std::vector<std::vector<int>> grid = {
		{1, 0, 0, 0, 1, 0, 1, 0, 0, 0},
		{2, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{0, 0, 0, 1, 0, 0, 0, 0, 0, 1},
		{1, 0, 1, 0, 0, 1, 0, 0, 0, 0},
		{1, 1, 1, 0, 0, 0, 0, 0, 0, 0},
		{0, 1, 0, 0, 1, 0, 0, 0, 0, 1},
		{0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
		{1, 0, 0, 0, 0, 1, 0, 0, 0, 0},
		{0, 0, 1, 0, 1, 1, 0, 0, 0, 0},
		{1, 0, 0, 1, 0, 0, 0, 0, 1, 3}
	};

	// "custom" - режим пользовательской сетки
	// "random" - режим случайно сгенерированной сетки; вес клеток = 1
	// "random_weight" - режим случайно сгенерированной сетки; вес клеток случайный
	
	AStarVisualization app("custom", &grid);
	//AStarVisualization app("random");
	//AStarVisualization app("random_weight");

	app.run();

	return 0;
}